STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_uart.c
/**
  **********************************************************************************************************************
  * @file    stm32_adv_lpbam_uart.c
  * @author  MCD Application Team
  * @brief   This file provides the advanced LPBAM layer for UART peripheral.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  @verbatim
  ======================================================================================================================
                                 ############### How to use this driver ###############
  ======================================================================================================================
    [..]
      It is strongly recommended to read carefully the GettingStarted.html document before starting developing an LPBAM
      application.

    *** Driver description ***
    ==========================
    [..]
      This driver is dedicated for UART that can change configuration and operate in low power mode.
      This advanced LPBAM module counts 3 files :
          (+) stm32_adv_lpbam_uart.c
              (++) This file provides the UART advanced files body.
          (+) stm32_adv_lpbam_uart.h
              (++) This file is the header file of stm32_adv_lpbam_uart.c. It provides advanced used types.
          (+) stm32_platform_lpbam_uart.h
              (++) This header file contains all defines to be used in applicative side.

    *** Driver features ***
    =======================
    [..]
      This driver provides the following list of features :
          (+) Configure the UART transfers in simplex and full duplex modes.
          (+) Starts the UART data transfers in simplex and full duplex modes.
          (+) Configure and starts the UART data transfers in simplex and full duplex modes.

    *** Functional description ***
    ==============================
    [..]
      The UART peripheral is configured and started through a DMA channel thanks to a built DMA linked-list queue in
      simplex and full duplex mode.
      The UART peripheral transfer is started through a DMA channel thanks to a build DMA linked-list queue in simplex
      and full duplex mode.
      The UART peripheral transfer is configured and started through a DMA channel thanks to a build DMA linked-list
      queue in simplex and full duplex mode.

      The output of each API is one linked-list queue. For simplex transfer, it is performed by executing one API
      (Transmit or receive) according application needs. For the full duplex transfer, it is performed by executing two
      APIs (one Transmit and one receive) then link each one to different DMA channel. (Please refer to Driver APIs
      description and user sequence section for more information).

    *** Driver APIs description ***
    ===============================
    [..]
      Use ADV_LPBAM_UART_Transmit_SetConfigQ() API to build a linked-list queue that setup the UART transmission
      configuration operation according to parameters in the LPBAM_UART_ConfigAdvConf_t structure.
      Configured parameters are :
          (+) Mode         : Specifies the UART mode.
                             This parameter can be a value of @ref LPBAM_UART_Mode.
          (+) AutoModeConf : Specifies the autonomous mode parameters.
                             (++) AutonomousModeState : Specifies the autonomous mode state.
                                                        This parameter can be a value
                                                        of @ref LPBAM_UART_AutonomousMode_State.
                             (++) TriggerSelection    : Specifies the autonomous mode trigger signal selection.
                                                        This parameter can be a value
                                                        of @ref LPBAM_UART_AutonomousMode_TriggerSelection.
                             (++) TriggerPolarity     : Specifies the autonomous mode trigger signal polarity
                                                        sensitivity.
                                                        This parameter can be a value
                                                        of @ref LPBAM_UART_AutonomousMode_TriggerPolarity.
                             (++) DataSize            : Specifies the UART data number of bytes to transfer in each
                                                        packet.
          (+) WakeupIT    : Specifies the wake up source.
                            UART wake up IT can be:
                            (++) NONE  : UART wake up interrupt none.
                            (++) IDLE  : UART idle interrupt.
                            (++) TC    : UART transfer complete interrupt.
                            (++) TXFNF : UART TX FIFO not full interrupt.
                            (++) TXFE  : UART TX FIFO empty interrupt.

    [..]
      Use ADV_LPBAM_UART_Transmit_SetDataQ() API to build a linked-list queue that setup the UART transmission operation
      starting according to parameters in the LPBAM_UART_DataAdvConf_t structure.
      The data node default configuration is as follow:
          (+) SrcInc            : DMA_SINC_INCREMENTED.
          (+) DestInc           : DMA_DINC_FIXED. (Mandatory)
          (+) SrcDataWidth      : DMA_SRC_DATAWIDTH_BYTE.
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_BYTE. (Mandatory)
          (+) TransferEventMode : DMA_TCEM_LAST_LL_ITEM_TRANSFER.
          (+) SrcSecure         : DMA_CHANNEL_SRC_SEC. (For trust zone devices)
          (+) DestSecure        : DMA_CHANNEL_DEST_SEC. (For trust zone devices)

      Configured parameters are :
          (+) pData : Specifies the data source buffer.
          (+) Size  : Specifies the data number of bytes to be sent.

