STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_uart.c
    [..]
      Use ADV_LPBAM_UART_Transmit_SetFullQ() API to build a linked-list queue that setup the UART configuration and
      transmission starting according to parameters in the LPBAM_UART_FullAdvConf_t structure.
      The data node default configuration is as follow:
          (+) SrcInc            : DMA_SINC_INCREMENTED.
          (+) DestInc           : DMA_DINC_FIXED. (Mandatory)
          (+) SrcDataWidth      : DMA_SRC_DATAWIDTH_BYTE.
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_BYTE. (Mandatory)
          (+) TransferEventMode : DMA_TCEM_LAST_LL_ITEM_TRANSFER.
          (+) SrcSecure         : DMA_CHANNEL_SRC_SEC. (For trust zone devices)
          (+) DestSecure        : DMA_CHANNEL_DEST_SEC. (For trust zone devices)

      Configured parameters are :
          (+) Mode         : Specifies the UART mode.
                             This parameter can be a value of @ref LPBAM_UART_Mode.
          (+) AutoModeConf : Specifies the autonomous mode parameters.
                             (++) AutonomousModeState : Specifies the autonomous mode state.
                                                        This parameter can be a value
                                                        of @ref LPBAM_UART_AutonomousMode_State.
                             (++) TriggerSelection    : Specifies the autonomous mode trigger signal selection.
                                                        This parameter can be a value
                                                        of @ref LPBAM_UART_AutonomousMode_TriggerSelection.
                             (++) TriggerPolarity     : Specifies the autonomous mode trigger signal polarity
                                                        sensitivity.
                                                        This parameter can be a value
                                                        of @ref LPBAM_UART_AutonomousMode_TriggerPolarity.
                             (++) DataSize            : Specifies the UART data number of bytes to transfer in each
                                                        packet.
          (+) WakeupIT    : Specifies the wake up source.
                            UART wake up IT can be:
                            (++) NONE  : UART wake up interrupt none.
                            (++) IDLE  : UART idle interrupt.
                            (++) TC    : UART transfer complete interrupt.
                            (++) TXFNF : UART TX FIFO not full interrupt.
                            (++) TXFE  : UART TX FIFO empty interrupt.
          (+) pData       : Specifies the data source buffer.
          (+) Size        : Specifies the data number of bytes to be sent.

    [..]
      Use ADV_LPBAM_UART_Receive_SetConfigQ() API to build a linked-list queue that setup the UART reception
      configuration operation according to parameters in the LPBAM_UART_ConfigAdvConf_t structure.
      Configured parameters are :
          (+) Mode     : Specifies the UART mode.
                         This parameter can be a value of @ref LPBAM_UART_Mode.
          (+) WakeupIT : Specifies the wake up source.
                         UART wake up IT can be:
                         (++) NONE  : UART wake up interrupt none.
                         (++) RXFNE : UART RX FIFO not empty interrupt.
                         (++) RXFF  : UART RX FIFO full interrupt.

    [..]
      Use ADV_LPBAM_UART_Receive_SetDataQ() API to build a linked-list queue that setup the UART reception operation
      starting according to parameters in the LPBAM_UART_DataAdvConf_t structure.
      The data node default configuration is as follow:
          (+) SrcInc            : DMA_SINC_FIXED. (Mandatory)
          (+) DestInc           : DMA_DINC_INCREMENTED.
          (+) SrcDataWidth      : DMA_SRC_DATAWIDTH_BYTE. (Mandatory)
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_BYTE.
          (+) TransferEventMode : DMA_TCEM_LAST_LL_ITEM_TRANSFER.
          (+) SrcSecure         : DMA_CHANNEL_SRC_SEC. (For trust zone devices)
          (+) DestSecure        : DMA_CHANNEL_DEST_SEC. (For trust zone devices)

      Configured parameters are :
          (+) pData : Specifies the data source buffer.
          (+) Size  : Specifies the data number of bytes to be sent.

    [..]
      Use ADV_LPBAM_UART_Receive_SetFullQ() API to build a linked-list queue that setup the UART configuration and
      reception starting according to parameters in the LPBAM_UART_FullAdvConf_t structure.
      The data node default configuration is as follow:
          (+) SrcInc            : DMA_SINC_FIXED. (Mandatory)
          (+) DestInc           : DMA_DINC_INCREMENTED.
          (+) SrcDataWidth      : DMA_SRC_DATAWIDTH_BYTE. (Mandatory)
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_BYTE.
          (+) TransferEventMode : DMA_TCEM_LAST_LL_ITEM_TRANSFER.
          (+) SrcSecure         : DMA_CHANNEL_SRC_SEC. (For trust zone devices)
          (+) DestSecure        : DMA_CHANNEL_DEST_SEC. (For trust zone devices)

      Configured parameters are :
          (+) Mode     : Specifies the UART mode.
                         This parameter can be a value of @ref LPBAM_UART_Mode.
          (+) WakeupIT : Specifies the wake up source.
                         UART wake up IT can be:
                         (++) NONE  : UART wake up interrupt none.
                         (++) RXFNE : UART RX FIFO not empty interrupt.
                         (++) RXFF  : UART RX FIFO full interrupt.
          (+) pData    : Specifies the data source buffer.
          (+) Size     : Specifies the data number of bytes to be sent.

      These APIs must be called when the UART is well initialized.
           (+) Recommended UART initialization sequence
              (++) Call HAL_UART_Init() to initialize the UART. (Mandatory)
                   Initialization parameters can be :
                   (+++) BaudRate       : Any.
                   (+++) WordLength     : Any.
                   (+++) StopBits       : Any.
                   (+++) Parity         : Any.
                   (+++) HwFlowCtl      : UART_HWCONTROL_NONE.
                   (+++) Mode           : Any.
                   (+++) ClockPrescaler : Any.
                   (+++) AdvFeatureInit : UART_ADVFEATURE_NO_INIT.
              (++) Call HAL_UARTEx_SetConfigAutonomousMode() to configure the autonomous mode.(Mandatory only for
                   transmission)
                   Autonomous mode parameters can be :
                   (+++) AutonomousModeState : UART_AUTONOMOUS_MODE_ENABLE.
                   (+++) IdleFrame           : Any.
                   (+++) TriggerPolarity     : Any.
                   (+++) TriggerSelection    : Any.
                   (+++) DataSize            : Any.
              (++) Call HAL_UARTEx_EnableStopMode() to enable the UART in stop mode. (Mandatory)
              (++) Call __HAL_UART_ENABLE_IT() to enable error interrupts.
                   UART error interrupts can be :
                   (+++) UART_IT_ERR : overrun error, framing error, noise error.
                   (+++) UART_IT_PE  : Parity error (When parity bit is enabled).

    *** Driver user sequence ***
    ============================
    [..]
      Simplex user sequence :
          (+) Initialize the UART (Using HAL/LL). (Mandatory)
          (+) Call ADV_LPBAM_UART_EnableDMARequests() to enable the UART DMA requests. (Mandatory)
          (+) Repeat calling ADV_LPBAM_UART_{Transfer}_SetConfigQ() and/or ADV_LPBAM_UART_{Transfer}_SetDataQ() and/or
              ADV_LPBAM_UART_{Transfer}_SetFullQ until completing LPBAM scenario. (Mandatory)
          (+) Call ADV_LPBAM_Q_SetTriggerConfig() to add hardware trigger condition for executing output
              queues. (Optional)
              (++) Please check stm32_adv_lpbam_common.c (how to use section) for more information.
          (+) Call ADV_LPBAM_Q_SetCircularMode() to circularize your linked-list queue for infinite scenarios
              cases. (Optional)
              (++) Please check stm32_adv_lpbam_common.c (how to use section) for more information.
          (+) Call HAL_DMAEx_List_Init() to initialize a DMA channel in linked-list mode (Using HAL/LL). (Mandatory)
          (+) Call HAL_DMAEx_List_LinkQ() to link the output queue to the initialized DMA channel. (Mandatory)
          (+) Call __HAL_DMA_ENABLE_IT() to enable error interrupts.
              Any DMA error occurred in low power block the LPBAM sub-system mechanisms.
              DMA error interrupts can be :
              (++) DMA_IT_DTE : data transfer error.
              (++) DMA_IT_ULE : update link error.
              (++) DMA_IT_USE : user setting error.
          (+) Call HAL_DMAEx_List_Start() to start the DMA channel linked-list execution. (Mandatory)

