STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_uart.c
    [..]
      Full duplex user sequence :
          (+) Initialize the UART (Using HAL/LL). (Mandatory)
          (+) Call ADV_LPBAM_UART_EnableDMARequests() to enable the UART DMA requests. (Mandatory)
          (+) Repeat calling ADV_LPBAM_UART_Receive_SetConfigQ() and/or ADV_LPBAM_UART_Receive_SetDataQ() and/or
              ADV_LPBAM_UART_Receive_SetFullQ until completing LPBAM scenario. (Mandatory)
          (+) Repeat calling ADV_LPBAM_UART_Transmit_SetConfigQ() and/or ADV_LPBAM_UART_Transmit_SetDataQ() and/or
              ADV_LPBAM_UART_Transmit_SetFullQ until completing LPBAM scenario. (Mandatory)
          (+) Call ADV_LPBAM_Q_SetTriggerConfig() to add hardware trigger condition for executing output
              queues. (Optional)
              (++) Please check stm32_adv_lpbam_common.c (how to use section) for more information.
          (+) Call ADV_LPBAM_Q_SetCircularMode() to circularize your linked-list queue for infinite scenarios
              cases. (Optional)
              (++) Please check stm32_adv_lpbam_common.c (how to use section) for more information.
          (+) Call HAL_DMAEx_List_Init() to initialize the receive DMA channel in linked-list
              mode (Using HAL/LL). (Mandatory)
          (+) Call HAL_DMAEx_List_LinkQ() to link the receive output queue to the initialized
              receive DMA channel. (Mandatory)
          (+) Call __HAL_DMA_ENABLE_IT() to enable error interrupts.
              Any DMA error occurred in low power block the LPBAM sub-system mechanisms.
              DMA error interrupts can be :
              (++) DMA_IT_DTE : data transfer error.
              (++) DMA_IT_ULE : update link error.
              (++) DMA_IT_USE : user setting error.
          (+) Call HAL_DMAEx_List_Start() to start the receive DMA channel linked-list execution. (Mandatory)
          (+) Call HAL_DMAEx_List_Init() to initialize the transmit DMA channel in linked-list
              mode (Using HAL/LL). (Mandatory)
          (+) Call HAL_DMAEx_List_LinkQ() to link the transmit output queue to the initialized
              transmit DMA channel. (Mandatory)
          (+) Call __HAL_DMA_ENABLE_IT() to enable error interrupts.
              Any DMA error occurred in low power block the LPBAM sub-system mechanisms.
              DMA error interrupts can be :
              (++) DMA_IT_DTE : data transfer error.
              (++) DMA_IT_ULE : update link error.
              (++) DMA_IT_USE : user setting error.
          (+) Call HAL_DMAEx_List_Start() to start the transmit DMA channel linked-list execution. (Mandatory)


    *** Constraints ***
    ===================
    [..]
      It's useless to call ADV_LPBAM_UART_{Transfer}_SetConfigQ() consecutively as the first configuration will be
      overwritten.

    [..]
      It's useless to call ADV_LPBAM_UART_{Transfer}_SetConfigQ() before ADV_LPBAM_UART_{Transfer}_SetFullQ() as
      ADV_LPBAM_UART_{Transfer}_SetFullQ() APIs contains configuration process.

    [..]
      It's mandatory to starts the receive DMA channel before the transmit DMA channel in full duplex mode.

    [..]
      It's strongly not recommended to execute the same linked-list queue that contains UART transfers configuration
      by two different DMA channels as unexpected behavior can appear.

    [..]
      It's strongly not recommended to call the UART advanced APIs with the same instance by more than
      one linked-list queue. When the UART nodes will be executed simultaneously unexpected behavior will appear.

    [..]
      It's mandatory to use two DMA channels for full duplex transfers and only one DMA channels for simplex transfers.

    *** Driver status description ***
    =================================
    [..]
      This driver detects and reports any detected issue.
          (+) returned values are :
              (++) LPBAM_OK when no error is detected.
              (++) LPBAM_ERROR when error is detected.
              (++) LPBAM_INVALID_ID when an invalid node ID is detected. This error value is specific for LPBAM basic
                   layer.

    @endverbatim
  **********************************************************************************************************************
  */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32_lpbam.h"

#ifdef LPBAM_UART_MODULE_ENABLED

/* Private typedef ---------------------------------------------------------------------------------------------------*/
/* Private define ----------------------------------------------------------------------------------------------------*/
/* Private variables -------------------------------------------------------------------------------------------------*/
/* Private macro -----------------------------------------------------------------------------------------------------*/
/* Private function prototypes ---------------------------------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup LPBAM_Utilities_Driver
  * @{
  */

/** @defgroup UART_Advanced UART_Advanced
  * @brief    UART Advanced LPBAM module driver
  * @{
  */

/** @defgroup LPBAM_UART_Advanced_Exported_Functions LPBAM UART Advanced Exported Functions
  * @{
  */

/**
  * @brief  Build the UART transmit configuration nodes in DMA linked-list queue according to configured parameters in
  *         LPBAM_UART_ConfigAdvConf_t.
  * @param  pInstance    : [IN]  Pointer to a USART_TypeDef structure that selects UART instance.
  * @param  pDMAListInfo : [IN]  Pointer to a LPBAM_DMAListInfo_t structure that contains DMA instance and linked-list
  *                              queue type information.
  * @param  pTxConfig    : [IN]  Pointer to a LPBAM_UART_ConfigAdvConf_t structure that contains transmit configuration
  *                              nodes information.
  * @param  pDescriptor  : [IN]  Pointer to a LPBAM_UART_TxConfigDesc_t structure that contains transmit configuration
  *                              descriptor information.
  * @param  pQueue       : [OUT] Pointer to a DMA_QListTypeDef structure that contains DMA linked-list queue
  *                              information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_UART_Transmit_SetConfigQ(USART_TypeDef              *const pInstance,
                                                  LPBAM_DMAListInfo_t        const *const pDMAListInfo,
                                                  LPBAM_UART_ConfigAdvConf_t const *const pTxConfig,
                                                  LPBAM_UART_TxConfigDesc_t  *const pDescriptor,
                                                  DMA_QListTypeDef           *const pQueue)
{
  LPBAM_UART_ConfNode_t config_node;
  DMA_NodeConfTypeDef   dma_node_conf;

  uint32_t node_idx = 0U;
  uint32_t reg_idx  = 0U;

