STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_uart.c
  /* Build Transmit data node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Transmit data node to UART queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  return LPBAM_OK;
}

/**
  * @brief  Build the UART transmit full nodes in DMA linked-list queue according to configured parameters in
  *         LPBAM_UART_FullAdvConf_t.
  * @param  pInstance    : [IN]  Pointer to a USART_TypeDef structure that selects UART instance.
  * @param  pDMAListInfo : [IN]  Pointer to a LPBAM_DMAListInfo_t structure that contains DMA instance and linked-list
  *                              queue type information.
  * @param  pTxFull      : [IN]  Pointer to a LPBAM_UART_FullAdvConf_t structure that contains transmit full nodes
  *                              information.
  * @param  pDescriptor  : [IN]  Pointer to a LPBAM_UART_TxFullDesc_t structure that contains transmit full descriptor
  *                              information.
  * @param  pQueue       : [OUT] Pointer to a DMA_QListTypeDef structure that contains DMA linked-list queue
  *                              information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_UART_Transmit_SetFullQ(USART_TypeDef            *const pInstance,
                                                LPBAM_DMAListInfo_t      const *const pDMAListInfo,
                                                LPBAM_UART_FullAdvConf_t const *const pTxFull,
                                                LPBAM_UART_TxFullDesc_t  *const pDescriptor,
                                                DMA_QListTypeDef         *const pQueue)
{
  LPBAM_UART_ConfNode_t config_node;
  DMA_NodeConfTypeDef   dma_node_conf;

  uint32_t node_idx = 0U;
  uint32_t reg_idx  = 0U;

  uint32_t buffer_address;

  /*
   *               ######## UART disable node ########
   */

  /* Set UART instance */
  config_node.pInstance                  = pInstance;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID   = (uint32_t)LPBAM_UART_CONFIG_ID;
  config_node.NodeDesc.NodeInfo.NodeType = pDMAListInfo->QueueType;
  config_node.NodeDesc.pSrcVarReg        = &pDescriptor->pReg[reg_idx];

  /* Set UART configuration */
  config_node.Config.State               = DISABLE;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_UART_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build config state node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert config state node to UART queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## UART clear flag node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_UART_CLEARFLAG_ID;
  config_node.NodeDesc.pSrcVarReg      = &pDescriptor->pReg[reg_idx];

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_UART_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build clear flag node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert clear flag node to UART queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## UART autonomous mode node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID                = (uint32_t)LPBAM_UART_AUTONOMOUSMODE_ID;
  config_node.NodeDesc.pSrcVarReg                     = &pDescriptor->pReg[reg_idx];

  /* Set UART configuration */
  config_node.Config.AutoModeConf.AutonomousModeState = pTxFull->AutoModeConf.AutonomousModeState;
  config_node.Config.AutoModeConf.TriggerSelection    = pTxFull->AutoModeConf.TriggerSelection;
  config_node.Config.AutoModeConf.TriggerPolarity     = pTxFull->AutoModeConf.TriggerPolarity;
  config_node.Config.AutoModeConf.DataSize            = pTxFull->AutoModeConf.DataSize;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_UART_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build config packet size node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert config packet size node to UART queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## UART enable node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_UART_CONFIG_ID;
  config_node.NodeDesc.pSrcVarReg      = &pDescriptor->pReg[reg_idx];

  /* Set UART configuration */
  config_node.Config.State             = ENABLE;
  config_node.Config.WakeupIT          = pTxFull->WakeupIT;

  /* Check UART mode */
  if (pTxFull->Mode == LPBAM_UART_MODE_TX)
  {
    config_node.Config.Mode = LPBAM_UART_MODE_TX;
  }
  else
  {
    config_node.Config.Mode = LPBAM_UART_MODE_TX_RX;
  }

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_UART_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build config state node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert config state node to UART queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;


