STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_uart.c
  /*
   *               ######## UART Transmit data node ########
   */

  /* Get buffer address */
  buffer_address                       = (uint32_t)pTxFull->pData;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_UART_TRANSMIT_DATA_ID;
  config_node.NodeDesc.pBuff           = (uint32_t *)buffer_address;

  /* Set UART configuration */
  config_node.Config.Size              = pTxFull->Size;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_UART_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build Transmit data node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Transmit data node to UART queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  return LPBAM_OK;
}

/**
  * @brief  Build the UART receive configuration nodes in DMA linked-list queue according to configured parameters in
  *         LPBAM_UART_ConfigAdvConf_t.
  * @param  pInstance    : [IN]  Pointer to a USART_TypeDef structure that selects UART instance.
  * @param  pDMAListInfo : [IN]  Pointer to a LPBAM_DMAListInfo_t structure that contains DMA instance and linked-list
  *                              queue type information.
  * @param  pRxConfig    : [IN]  Pointer to a LPBAM_UART_ConfigAdvConf_t structure that contains receive configuration
  *                              nodes information.
  * @param  pDescriptor  : [IN]  Pointer to a LPBAM_UART_RxConfigDesc_t structure that contains receive configuration
  *                              descriptor information.
  * @param  pQueue       : [OUT] Pointer to a DMA_QListTypeDef structure that contains DMA linked-list queue
  *                              information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_UART_Receive_SetConfigQ(USART_TypeDef              *const pInstance,
                                                 LPBAM_DMAListInfo_t        const *const pDMAListInfo,
                                                 LPBAM_UART_ConfigAdvConf_t const *const pRxConfig,
                                                 LPBAM_UART_RxConfigDesc_t  *const pDescriptor,
                                                 DMA_QListTypeDef           *const pQueue)
{
  LPBAM_UART_ConfNode_t config_node;
  DMA_NodeConfTypeDef   dma_node_conf;

  uint32_t node_idx = 0U;
  uint32_t reg_idx  = 0U;

  /*
   *               ######## UART clear flag node ########
   */

  /* Set UART instance */
  config_node.pInstance                  = pInstance;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID   = (uint32_t)LPBAM_UART_CLEARFLAG_ID;
  config_node.NodeDesc.NodeInfo.NodeType = pDMAListInfo->QueueType;
  config_node.NodeDesc.pSrcVarReg        = &pDescriptor->pReg[reg_idx];

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_UART_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build clear flag node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert clear flag node to UART queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /* Check UART mode */
  if (pRxConfig->Mode == LPBAM_UART_MODE_RX)
  {
    /*
     *               ######## UART Wake up Interrupt node ########
     */

    /* Set node descriptor */
    config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_UART_CONFIG_ID;
    config_node.NodeDesc.pSrcVarReg      = &pDescriptor->pReg[reg_idx];

    /* Set UART configuration */
    config_node.Config.State             = ENABLE;
    config_node.Config.Mode              = LPBAM_UART_MODE_RX;
    config_node.Config.WakeupIT          = pRxConfig->WakeupIT;

    /* Fill descriptor for lpbam configuration transaction */
    if (LPBAM_UART_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
    {
      return LPBAM_ERROR;
    }

    /* Build config interrupt node */
    if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[node_idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }

    /* Insert config interrupt node to UART queue */
    if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }
  }

  return LPBAM_OK;
}

/**
  * @brief  Build the UART receive data nodes in DMA linked-list queue according to configured parameters in
  *         LPBAM_UART_DataAdvConf_t.
  * @param  pInstance    : [IN]  Pointer to a USART_TypeDef structure that selects UART instance.
  * @param  pDMAListInfo : [IN]  Pointer to a LPBAM_DMAListInfo_t structure that contains DMA instance and linked-list
  *                              queue type information.
  * @param  pRxData      : [IN]  Pointer to a LPBAM_UART_DataAdvConf_t structure that contains receive data nodes
  *                              information.
  * @param  pDescriptor  : [IN]  Pointer to a LPBAM_UART_RxDataDesc_t structure that contains receive data descriptor
  *                              information.
  * @param  pQueue       : [OUT] Pointer to a DMA_QListTypeDef structure that contains DMA linked-list queue
  *                              information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_UART_Receive_SetDataQ(USART_TypeDef            *const pInstance,
                                               LPBAM_DMAListInfo_t      const *const pDMAListInfo,
                                               LPBAM_UART_DataAdvConf_t const *const pRxData,
                                               LPBAM_UART_RxDataDesc_t  *const pDescriptor,
                                               DMA_QListTypeDef         *const pQueue)
{
  LPBAM_UART_ConfNode_t config_node;
  DMA_NodeConfTypeDef   dma_node_conf;

  uint32_t node_idx = 0U;

