STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_uart.c
  uint32_t buffer_address;

  /*
   *               ######## UART Receive data node ########
   */

  /* Set UART instance */
  config_node.pInstance                  = pInstance;

  /* Get period buffer address */
  buffer_address                         = (uint32_t)pRxData->pData;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID   = (uint32_t)LPBAM_UART_RECEIVE_DATA_ID;
  config_node.NodeDesc.NodeInfo.NodeType = pDMAListInfo->QueueType;
  config_node.NodeDesc.pBuff             = (uint32_t *)buffer_address;

  /* Set UART configuration */
  config_node.Config.Size = pRxData->Size;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_UART_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build receive data node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert receive data node to UART queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  return LPBAM_OK;
}

/**
  * @brief  Build the UART receive full nodes in DMA linked-list queue according to configured parameters in
  *         LPBAM_UART_FullAdvConf_t.
  * @param  pInstance    : [IN]  Pointer to a USART_TypeDef structure that selects UART instance.
  * @param  pDMAListInfo : [IN]  Pointer to a LPBAM_DMAListInfo_t structure that contains DMA instance and linked-list
  *                              queue type information.
  * @param  pRxFull      : [IN]  Pointer to a LPBAM_UART_FullAdvConf_t structure that contains receive full nodes
  *                              information.
  * @param  pDescriptor  : [IN]  Pointer to a LPBAM_UART_RxFullDesc_t structure that contains receive full descriptor
  *                              information.
  * @param  pQueue       : [OUT] Pointer to a DMA_QListTypeDef structure that contains DMA linked-list queue
  *                              information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_UART_Receive_SetFullQ(USART_TypeDef            *const pInstance,
                                               LPBAM_DMAListInfo_t      const *const pDMAListInfo,
                                               LPBAM_UART_FullAdvConf_t const *const pRxFull,
                                               LPBAM_UART_RxFullDesc_t  *const pDescriptor,
                                               DMA_QListTypeDef         *const pQueue)
{
  LPBAM_UART_ConfNode_t config_node;
  DMA_NodeConfTypeDef   dma_node_conf;

  uint32_t node_idx = 0U;
  uint32_t reg_idx  = 0U;

  uint32_t buffer_address;

  /*
   *               ######## UART clear flag node ########
   */

  /* Set UART instance */
  config_node.pInstance                  = pInstance;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID   = (uint32_t)LPBAM_UART_CLEARFLAG_ID;
  config_node.NodeDesc.NodeInfo.NodeType = pDMAListInfo->QueueType;
  config_node.NodeDesc.pSrcVarReg        = &pDescriptor->pReg[reg_idx];

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_UART_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build clear flag node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert clear flag node to UART queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /* Check UART mode */
  if (pRxFull->Mode == LPBAM_UART_MODE_RX)
  {
    /*
     *               ######## UART Wake up Interrupt node ########
     */

    /* Set node descriptor */
    config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_UART_CONFIG_ID;
    config_node.NodeDesc.pSrcVarReg      = &pDescriptor->pReg[reg_idx];

    /* Set UART configuration */
    config_node.Config.State             = ENABLE;
    config_node.Config.Mode              = LPBAM_UART_MODE_RX;
    config_node.Config.WakeupIT          = pRxFull->WakeupIT;

    /* Fill descriptor for lpbam configuration transaction */
    if (LPBAM_UART_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
    {
      return LPBAM_ERROR;
    }

    /* Build config interrupt node */
    if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[node_idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }

    /* Insert config interrupt node to UART queue */
    if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }
  }

  /* Update node index and register index */
  node_idx++;


  /*
   *               ######## UART Receive data node ########
   */

  /* Get period buffer address */
  buffer_address                       = (uint32_t)pRxFull->pData;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_UART_RECEIVE_DATA_ID;
  config_node.NodeDesc.pBuff           = (uint32_t *)buffer_address;

  /* Set UART configuration */
  config_node.Config.Size              = pRxFull->Size;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_UART_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build receive data node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert receive data node to UART queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  return LPBAM_OK;
}

/**
  * @brief  Enable the uart TX and Rx DMA requests.
  * @param  pInstance    : [IN]  Pointer to a USART_TypeDef structure that selects UART instance.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_UART_EnableDMARequests(USART_TypeDef *const pInstance)
{
  /* Enable UART TX/Rx DMA requests */
  pInstance->CR3 |= (LPBAM_UART_DMAT | LPBAM_UART_DMAR);

  return LPBAM_OK;
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* LPBAM_UART_MODULE_ENABLED */
